app/controllers/libros_controller.rb

  def index
    # Muestra x libros por página, busca por un patrón y ordena los productos al clicar en la cabecera de la columna
    @libros = Libro.search(params[:search]).order(sort_column + " " + sort_direction).paginate(:per_page => 10, :page => params[:page])
---
SELECT  `libros`.* FROM `libros` WHERE (titulo LIKE '%%')  ORDER BY fregistro asc LIMIT 10 OFFSET 0
SELECT COUNT(*) FROM `libros` WHERE (titulo LIKE '%%')

  def create
    @libro = Libro.new(libro_params)

    respond_to do |format|
      if @libro.save
---
INSERT INTO `libros` (`titulo`, `autor`, `genero`, `isbn`, `portada`, `fregistro`, `created_at`, `updated_at`) VALUES ('El Quijote', 'Cervantes', 'Aventuras', 123456, 'tigre-hd-3455.jpg', '2016-03-09', '2016-03-09 15:46:08', '2016-03-09 15:46:08')

  def update
    respond_to do |format|
      if @libro.update(libro_params)
---
UPDATE `libros` SET `isbn` = 12345678, `updated_at` = '2016-03-09 18:47:33' WHERE `libros`.`id` = 1

  def destroy
    @libro.destroy
---
DELETE FROM `libros` WHERE `libros`.`id` = 1

    def set_libro
      @libro = Libro.find(params[:id])
---
SELECT  `libros`.* FROM `libros` WHERE `libros`.`id` = NULL LIMIT 1