app/controllers/users_controller.rb

    def index
        @users = User.search(params[:search]).order(sort_column + " " + sort_direction).paginate(:per_page => 10, :page => params[:page])
---
SELECT `users`.* FROM `users`

    def update
        if params[:user][:password].blank?
            params[:user].delete(:password)
            params[:user].delete(:password_confirmation)
        end
        @user = User.find(params[:id])
        respond_to do |format|
          if @user.update(user_params)
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1  ORDER BY `users`.`id` ASC LIMIT 1
UPDATE `users` SET `username` = 'edertxoe', `updated_at` = '2016-03-15 20:31:43' WHERE `users`.`id` = 1